sdcStressTest.yml
config:
  processor: './stressTestScript.js'
  target: 'http://localhost:3003'
  phases:
    # - duration: 10
    #   arrivalRate: 1 #1 virtual user in 10 seconds, aka 10 users
    # - duration: 10
    #   arrivalRate: 10 #10 virtual users every second in span of 10 seconds aka 100 total users 
    # - duration: 10
    #   arrivalRate: 100 #100 users every second in span of 10 seconds aka 1000 total
    # - duration: 10
    #   arrivalRate: 1000 #1000 users every second in span of 10 seconds aka 10,000 total
    - duration: 10
      arrivalRate: 10
      rampTo: 1000
      name: '10-1000'
scenarios:
  - name: "Searching Courses By ID"
    flow: #call stressTestScript.js generateRandomData() to create the fake info
      - function: 'generateRandomData'
      #-loop:
      - get:
          # url: "/courses/{{ id }}/header"
          url: "/courses/2/header"
      #note: break up scenarios to run in two rounds
      # - post:
      #     url: "/courses"
      #     json:
      #       title: "{{ title }}"
      #       description: "{{ description }}" 
      #       tag: "{{ tag }}"
      #       avgRating: "{{ avgRating }}"
      #       totalRatings: "{{ totalRatings }}"
      #       enrollment: "{{ enrollment }}"
      #       createdBy: "{{ createdBy }}"
      #       lastUpdated: "{{ lastUpdated }}"
      #       language: "{{ language }}"
      #       imgUrl: "{{ imgUrl }}"
      #       listPrice: "{{ listPrice }}"
      #       discountPrice: "{{ discountPrice }}"
      #       videoHrs: "{{ videoHrs }}"
      #       totalArticles: "{{ totalArticles }}"
      #       totalDownloads: "{{ totalDownloads }}"
      #       activeCoupon: "{{ activeCoupon }}"
      #       ccOptions: "{{ ccOptions }}"